<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"d277609803556c8124b6efe51b034ef6241ff2948e49b96c0c3a940d3579c72a","plan_job_ref":"Job Pull Request Checks #4504 at https://github.com/GSA-TTS/FAC/actions/runs/14090574706","plan_out_hash":"c60d31dc6e9e223644b02d0871b0b38ede6203ac22afbb76dec4d0a82bb79df4","plan_hash":"f71d5bd653dc4b6a3a4b0e8a0e0ce847d95e9f70e0f2283a2226b66cda75ec15","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 4 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "99884884-59ae-8864-786d-a5e33d1b1455"

-       policy {
-           destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "bfcc67a1-8ace-45fe-b472-0594da8ab39b" -> null
        }
-       policy {
-           destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "bfcc67a1-8ace-45fe-b472-0594da8ab39b"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992"
        }
    }

  # module.dev.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "30fc72e9-9a5e-c40d-140c-98bc1b576989"

-       policy {
-           destination_app = "a6eb3870-2769-4aa9-a8f2-f1a31939f563" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
        }
-       policy {
-           destination_app = "a6eb3870-2769-4aa9-a8f2-f1a31939f563" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
        }
+       policy {
+           destination_app = "a6eb3870-2769-4aa9-a8f2-f1a31939f563"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "a6eb3870-2769-4aa9-a8f2-f1a31939f563"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b69d4d374a43cd1d45d015a49e42f391194729e1f716cf98d28b415982225abb" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a73b18094206cac34dc03bbbbfb5892f4b723bb35e6fab14e23381abecd6a1fa"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-20T12:53:42Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-03-20T12:53:36Z" -> (known after apply)
        }
    }

  # module.dev.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b69d4d374a43cd1d45d015a49e42f391194729e1f716cf98d28b415982225abb" -> "ghcr.io/gsa-tts/fac/clamav@sha256:a73b18094206cac34dc03bbbbfb5892f4b723bb35e6fab14e23381abecd6a1fa"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-20T12:53:41Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4504](https://github.com/GSA-TTS/FAC/actions/runs/14090574706)